tutorial/first_app.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-15 Wed 09:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>First App</title>
<meta name="author" content="Jackson Mowry" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">First App</h1>
<div id="outline-container-org5f0912c" class="outline-2">
<h2 id="org5f0912c">Getting Started</h2>
<div class="outline-text-2" id="text-org5f0912c">
<p>
Hopefully you&rsquo;ve read the <a href="../README.html">README</a>, but I&rsquo;ll repeat the highlights here. We can make the entire project, including dependencies by simply running <code>make</code>. Additionally, you can override the compiler and any flags you wish to pass through to it.
</p>

<p>
<a href="org:../README.org">README</a>
</p>

<p>
<a href="../README.html">README</a>
</p>

<a href="../README.org">README</a>

<a href="../">README</a>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">make</span>
</pre>
</div>

<p>
<i>The make rule <code>riscv_vector</code> should only be provided when building for a platform that supports the RISCV Vector Extension version 1.0.</i>
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">make</span> riscv_vector <span style="color: #dcaeea;">CXX</span>=<span style="color: #98be65;">'riscv64-linux-gnu-g++'</span> <span style="color: #dcaeea;">CFLAGS</span>=<span style="color: #98be65;">'-march=rv64gcv -Ofast -static'</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 1/15/25</p>
<p class="author">Author: Jackson Mowry</p>
<p class="date">Created: 2025-01-15 Wed 09:52</p>
</div>
</body>
</html>
